frosted123456/LIGHTGUN-STUDIO-ESP32S3-OV2640-New-quad-Pipeline-Calibration-and-RX/lib/esp32-camera-ov2640/target/esp32s3/ll_cam.c
bool IRAM_ATTR ll_cam_stop(cam_obj_t *cam)
{
    if (cam->jpeg_mode || !cam->psram_mode) {
        GDMA.channel[cam->dma_num].in.int_ena.in_suc_eof = 0;
        GDMA.channel[cam->dma_num].in.int_clr.in_suc_eof = 1;
    }
    GDMA.channel[cam->dma_num].in.link.stop = 1;
    return true;
}

bool ll_cam_start(cam_obj_t *cam, int frame_pos)
{
    LCD_CAM.cam_ctrl1.cam_start = 0;

    if (cam->jpeg_mode || !cam->psram_mode) {
        GDMA.channel[cam->dma_num].in.int_clr.in_suc_eof = 1;
        GDMA.channel[cam->dma_num].in.int_ena.in_suc_eof = 1;
    }

    LCD_CAM.cam_ctrl1.cam_reset = 1;
    LCD_CAM.cam_ctrl1.cam_reset = 0;
    LCD_CAM.cam_ctrl1.cam_afifo_reset = 1;
    LCD_CAM.cam_ctrl1.cam_afifo_reset = 0;
    GDMA.channel[cam->dma_num].in.conf0.in_rst = 1;
    GDMA.channel[cam->dma_num].in.conf0.in_rst = 0;

    LCD_CAM.cam_ctrl1.cam_rec_data_bytelen = cam->dma_half_buffer_size - 1; // Ping pong operation

    if (!cam->psram_mode) {
        GDMA.channel[cam->dma_num].in.link.addr = ((uint32_t)&cam->dma[0]) & 0xfffff;
    } else {
        GDMA.channel[cam->dma_num].in.link.addr = ((uint32_t)&cam->frames[frame_pos].dma[0]) & 0xfffff;
    }

    GDMA.channel[cam->dma_num].in.link.start = 1;

    LCD_CAM.cam_ctrl.cam_update = 1;
    LCD_CAM.cam_ctrl1.cam_start = 1;
    return true;
}

esp_err_t ll_cam_deinit(cam_obj_t *cam)
{
    if (cam->cam_intr_handle) {
        esp_intr_free(cam->cam_intr_handle);
        cam->cam_intr_handle = NULL;
    }

    if (cam->dma_intr_handle) {
        esp_intr_free(cam->dma_intr_handle);
        cam->dma_intr_handle = NULL;
    }
    if (cam->dma_channel_handle) {
        // gdma_disconnect(cam->dma_channel_handle); // not needed since code never calls gdma_connect() to connect channel to peripheral
        gdma_del_channel(cam->dma_channel_handle);
        cam->dma_channel_handle = NULL;
        // GDMA.channel[cam->dma_num].in.link.addr = 0x0;
    }
    LCD_CAM.cam_ctrl1.cam_start = 0;
    LCD_CAM.cam_ctrl1.cam_reset = 1;
    LCD_CAM.cam_ctrl1.cam_reset = 0;
    return ESP_OK;
}

static esp_err_t ll_cam_dma_init(cam_obj_t *cam)
{
    //alloc rx gdma channel
#if (ESP_IDF_VERSION_MAJOR < 6)
    gdma_channel_alloc_config_t rx_alloc_config = {
        .direction = GDMA_CHANNEL_DIRECTION_RX,
    };
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 4, 0)
    esp_err_t ret = gdma_new_ahb_channel(&rx_alloc_config, &cam->dma_channel_handle);
#else
    esp_err_t ret = gdma_new_channel(&rx_alloc_config, &cam->dma_channel_handle);
#endif
#else
    gdma_channel_alloc_config_t rx_alloc_config = {0};
    esp_err_t ret = gdma_new_ahb_channel(&rx_alloc_config, NULL, &cam->dma_channel_handle);
#endif
    if (ret != ESP_OK) {
        cam_deinit();
        ESP_LOGE(TAG, "Can't find available GDMA channel");
        return ESP_FAIL;
    }
    int chan_id = -1;
    ret = gdma_get_channel_id(cam->dma_channel_handle, &chan_id);
    if (ret != ESP_OK) {
        cam_deinit();
        ESP_LOGE(TAG, "Can't get GDMA channel number");
        return ESP_FAIL;
    }
    cam->dma_num = chan_id;
    ESP_LOGI(TAG, "DMA Channel=%d", cam->dma_num);
    // for (int x = (SOC_GDMA_PAIRS_PER_GROUP - 1); x >= 0; x--) {
    //     if (GDMA.channel[x].in.link.addr == 0x0) {
    //         cam->dma_num = x;
    //         ESP_LOGI(TAG, "DMA Channel=%d", cam->dma_num);
    //         break;
    //     }
    //     if (x == 0) {
    //         cam_deinit();
    //         ESP_LOGE(TAG, "Can't found available GDMA channel");
	// 		return ESP_FAIL;
    //     }
    // }

#if ESP_IDF_VERSION_MAJOR > 5
    if (!(DPORT_REG_GET_BIT(SYSTEM_PERIP_RST_EN1_REG, SYSTEM_DMA_RST) == 0 &&
          DPORT_REG_GET_BIT(SYSTEM_PERIP_CLK_EN1_REG, SYSTEM_DMA_CLK_EN) != 0)) {
        DPORT_CLEAR_PERI_REG_MASK(SYSTEM_PERIP_CLK_EN1_REG, SYSTEM_DMA_CLK_EN);
        DPORT_SET_PERI_REG_MASK(SYSTEM_PERIP_RST_EN1_REG, SYSTEM_DMA_RST);
        DPORT_SET_PERI_REG_MASK(SYSTEM_PERIP_CLK_EN1_REG, SYSTEM_DMA_CLK_EN);
        DPORT_CLEAR_PERI_REG_MASK(SYSTEM_PERIP_RST_EN1_REG, SYSTEM_DMA_RST);
    }
#else
    if (!periph_ll_periph_enabled(PERIPH_GDMA_MODULE)) {
        periph_ll_disable_clk_set_rst(PERIPH_GDMA_MODULE);
        periph_ll_enable_clk_clear_rst(PERIPH_GDMA_MODULE);
    }
#endif
    ll_cam_dma_reset(cam);
    return ESP_OK;
}

#if CONFIG_CAMERA_CONVERTER_ENABLED
static esp_err_t ll_cam_converter_config(cam_obj_t *cam, const camera_config_t *config)
{
    esp_err_t ret = ESP_OK;

    switch (config->conv_mode) {
    case YUV422_TO_YUV420:
        if (config->pixel_format != PIXFORMAT_YUV422) {
            ret = ESP_FAIL;
        } else {
            ESP_LOGI(TAG, "YUV422 to YUV420 mode");
            LCD_CAM.cam_rgb_yuv.cam_conv_yuv2yuv_mode = 1;
            LCD_CAM.cam_rgb_yuv.cam_conv_yuv_mode = 0;
            LCD_CAM.cam_rgb_yuv.cam_conv_trans_mode = 1;
        }
        break;
    case YUV422_TO_RGB565:
        if (config->pixel_format != PIXFORMAT_YUV422) {
            ret = ESP_FAIL;
        } else {
            ESP_LOGI(TAG, "YUV422 to RGB565 mode");
            LCD_CAM.cam_rgb_yuv.cam_conv_yuv2yuv_mode = 3;
            LCD_CAM.cam_rgb_yuv.cam_conv_yuv_mode = 0;
            LCD_CAM.cam_rgb_yuv.cam_conv_trans_mode = 0;
        }
        break;
    default:
        break;
    }
#if CONFIG_LCD_CAM_CONV_BT709_ENABLED
    LCD_CAM.cam_rgb_yuv.cam_conv_protocol_mode = 1;
#else
    LCD_CAM.cam_rgb_yuv.cam_conv_protocol_mode = 0;
#endif
#if CONFIG_LCD_CAM_CONV_FULL_RANGE_ENABLED
    LCD_CAM.cam_rgb_yuv.cam_conv_data_out_mode = 1;
    LCD_CAM.cam_rgb_yuv.cam_conv_data_in_mode = 1;
#else
    LCD_CAM.cam_rgb_yuv.cam_conv_data_out_mode = 0;
    LCD_CAM.cam_rgb_yuv.cam_conv_data_in_mode = 0;
#endif
    LCD_CAM.cam_rgb_yuv.cam_conv_mode_8bits_on = 1;
    LCD_CAM.cam_rgb_yuv.cam_conv_bypass = 1;
    cam->conv_mode = config->conv_mode;
    return ret;
}
#endif

/* ===================== LIGHTGUN PATCH: EXACT XCLK =====================
 * Stock (both call sites) did:
 *     cam_clkm_div_num = 160000000 / xclk_freq_hz;   // INTEGER division
 *     cam_clkm_div_a = cam_clkm_div_b = 0;           // fraction disabled
 * so the S3 could only emit 160/N MHz. Requesting 27MHz silently produced
 * 160/5 = 32MHz -> 64MHz sysclk through the OV2640's 2x PLL, ~33% past its
 * analog limit: field-verified dead, banded frames where bright light reads
 * DARK, plus a bogus "160fps" (= 2.5 x 64, our own fps law).
 *
 * The LCD_CAM divider is really (N + B/A) with 6-bit A/B, so the frequencies
 * in between ARE reachable. 27MHz: N=5, B/A ~ 0.926 -> 160/(5+0.926) = 27.0.
 * This restores on S3 the exact clock the classic ESP32 made with LEDC — the
 * one that produced working 135fps capture.
 *
 * Exports the frequency actually programmed so firmware can print truth
 * instead of intent (ledc_get_freq() is meaningless here: the S3 camera clock
 * does not come from LEDC at all).
 */
uint32_t cam_patch_actual_xclk_hz = 0;

void lightgun_set_cam_clk(uint32_t xclk_freq_hz)
{
    const uint32_t src = 160000000u;
    if (xclk_freq_hz < 1000000u) xclk_freq_hz = 1000000u;
    uint32_t n = src / xclk_freq_hz;
    if (n < 2) n = 2;                       /* hardware minimum */
    if (n > 255) n = 255;
    uint32_t a = 0, b = 0;
    uint32_t rem = src - n * xclk_freq_hz;  /* 0 <= rem < xclk_freq_hz */
    if (rem > 0) {
        a = 63;                             /* max denominator = best precision */
        b = (uint32_t)(((uint64_t)a * rem + xclk_freq_hz / 2) / xclk_freq_hz);
        if (b == 0)      { a = 0; }                 /* rounds down to integer N */
        else if (b >= a) { a = 0; b = 0; n += 1; }  /* rounds up to N+1 */
    }
    LCD_CAM.cam_ctrl.cam_clkm_div_b = b;
    LCD_CAM.cam_ctrl.cam_clkm_div_a = a;
    LCD_CAM.cam_ctrl.cam_clkm_div_num = n;
    LCD_CAM.cam_ctrl.cam_clk_sel = 3;       /* PLL160 (empirically: 20MHz req -> 20MHz out) */
    cam_patch_actual_xclk_hz = (a && b)
        ? (uint32_t)(((uint64_t)src * a) / ((uint64_t)n * a + b))
        : src / n;
}
/* =================== END LIGHTGUN PATCH: EXACT XCLK =================== */

